<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b286135d44b6b353d7a9dcd61d311851d2440365688603cd75dfcf3450bee0be","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1086 at https://github.com/cal-itp/data-infra/actions/runs/19680984137","plan_out_hash":"5ff83978973c3d495d6d40c1d7191bbf1174e38f2f3fdddc52837e68f57eda2c","plan_hash":"f6fa5967d8ba4461cdd92b9fdb0880445cf717ef10784494c705be607465a3aa","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 27 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "G45q5g==" -> (known after apply)
!~      detect_md5hash      = "OUhCL3k2DpCHf618gklN/w==" -> "different hash"
!~      generation          = 1764029751596062 -> (known after apply)
        id                  = "calitp-staging-composer-dags/airtable_loader_v2/METADATA.yml"
!~      md5hash             = "OUhCL3k2DpCHf618gklN/w==" -> (known after apply)
        name                = "dags/airtable_loader_v2/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "sKYKYg==" -> (known after apply)
!~      detect_md5hash      = "S4DQZcKR8fXi7Z66L0bgyw==" -> "different hash"
!~      generation          = 1764029751923961 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/METADATA.yml"
!~      md5hash             = "S4DQZcKR8fXi7Z66L0bgyw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "TAOSvA==" -> (known after apply)
!~      detect_md5hash      = "BWlENDF70NFJXo55EWKoiQ==" -> "different hash"
!~      generation          = 1764029751910093 -> (known after apply)
        id                  = "calitp-staging-composer-dags/create_external_tables/METADATA.yml"
!~      md5hash             = "BWlENDF70NFJXo55EWKoiQ==" -> (known after apply)
        name                = "dags/create_external_tables/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dags.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "3xr3Zg==" -> (known after apply)
!~      detect_md5hash      = "BFTZSEOaU75gFCHcwbHOHg==" -> "different hash"
!~      generation          = 1764029751692756 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dags.py"
!~      md5hash             = "BFTZSEOaU75gFCHcwbHOHg==" -> (known after apply)
        name                = "dags/dags.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/download_gtfs_schedule_v2/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "1TPFVw==" -> (known after apply)
!~      detect_md5hash      = "oC2AyzffgaBgx5dupCEx3g==" -> "different hash"
!~      generation          = 1764029751917428 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_gtfs_schedule_v2/METADATA.yml"
!~      md5hash             = "oC2AyzffgaBgx5dupCEx3g==" -> (known after apply)
        name                = "dags/download_gtfs_schedule_v2/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/download_gtfs_schedule_v2/download_schedule_feeds.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "u3N2VA==" -> (known after apply)
!~      detect_md5hash      = "NRhDDTnpsf/59LhyhJZoUA==" -> "different hash"
!~      generation          = 1764029751595208 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_gtfs_schedule_v2/download_schedule_feeds.py"
!~      md5hash             = "NRhDDTnpsf/59LhyhJZoUA==" -> (known after apply)
        name                = "dags/download_gtfs_schedule_v2/download_schedule_feeds.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/download_gtfs_schedule_v2/email_download_failures.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "P+81jA==" -> (known after apply)
!~      detect_md5hash      = "DtRfRiM/GbTeaULCbvNRtw==" -> "different hash"
!~      generation          = 1764029751605166 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_gtfs_schedule_v2/email_download_failures.py"
!~      md5hash             = "DtRfRiM/GbTeaULCbvNRtw==" -> (known after apply)
        name                = "dags/download_gtfs_schedule_v2/email_download_failures.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/ntd_report_from_blackcat/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "b7sZsw==" -> (known after apply)
!~      detect_md5hash      = "zftXSxb6DjWQAW0jbAe8wg==" -> "different hash"
!~      generation          = 1764029751512509 -> (known after apply)
        id                  = "calitp-staging-composer-dags/ntd_report_from_blackcat/METADATA.yml"
!~      md5hash             = "zftXSxb6DjWQAW0jbAe8wg==" -> (known after apply)
        name                = "dags/ntd_report_from_blackcat/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "izcCNg==" -> (known after apply)
!~      detect_md5hash      = "OYzikIAicY+DHEzfTfaPLQ==" -> "different hash"
!~      generation          = 1764017282402906 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_gtfs.py"
!~      md5hash             = "OYzikIAicY+DHEzfTfaPLQ==" -> (known after apply)
        name                = "dags/parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_elavon/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "r3YIBQ==" -> (known after apply)
!~      detect_md5hash      = "WkP0/UF2+4C/242TEQdT7g==" -> "different hash"
!~      generation          = 1764029751938363 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_elavon/METADATA.yml"
!~      md5hash             = "WkP0/UF2+4C/242TEQdT7g==" -> (known after apply)
        name                = "dags/parse_elavon/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_littlepay_v3/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Vz87Kw==" -> (known after apply)
!~      detect_md5hash      = "rzmk4ePXXgNGJq0awwPAIw==" -> "different hash"
!~      generation          = 1764029751598778 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_littlepay_v3/METADATA.yml"
!~      md5hash             = "rzmk4ePXXgNGJq0awwPAIw==" -> (known after apply)
        name                = "dags/parse_littlepay_v3/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/scrape_feed_aggregators/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "lVhoPA==" -> (known after apply)
!~      detect_md5hash      = "Heuv7AyPpSoeZF6pg5r9rA==" -> "different hash"
!~      generation          = 1764029751920481 -> (known after apply)
        id                  = "calitp-staging-composer-dags/scrape_feed_aggregators/METADATA.yml"
!~      md5hash             = "Heuv7AyPpSoeZF6pg5r9rA==" -> (known after apply)
        name                = "dags/scrape_feed_aggregators/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/scrape_state_geoportal/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "kLSm0A==" -> (known after apply)
!~      detect_md5hash      = "jf1kvbUk9Uel1Z+KA70jcw==" -> "different hash"
!~      generation          = 1764029751600839 -> (known after apply)
        id                  = "calitp-staging-composer-dags/scrape_state_geoportal/METADATA.yml"
!~      md5hash             = "jf1kvbUk9Uel1Z+KA70jcw==" -> (known after apply)
        name                = "dags/scrape_state_geoportal/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_elavon/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Myqzug==" -> (known after apply)
!~      detect_md5hash      = "DcEGiLoj7uXBJfXxr4uaiQ==" -> "different hash"
!~      generation          = 1764029751495192 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_elavon/METADATA.yml"
!~      md5hash             = "DcEGiLoj7uXBJfXxr4uaiQ==" -> (known after apply)
        name                = "dags/sync_elavon/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_kuba/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "xPYXzQ==" -> (known after apply)
!~      detect_md5hash      = "nfOulVh3CAoZMU05O/8fmA==" -> "different hash"
!~      generation          = 1764029751702862 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_kuba/METADATA.yml"
!~      md5hash             = "nfOulVh3CAoZMU05O/8fmA==" -> (known after apply)
        name                = "dags/sync_kuba/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_littlepay_v3/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Jzfj6A==" -> (known after apply)
!~      detect_md5hash      = "4a9sx5Ml+OUnnj4tC4krig==" -> "different hash"
!~      generation          = 1764029751602768 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_littlepay_v3/METADATA.yml"
!~      md5hash             = "4a9sx5Ml+OUnnj4tC4krig==" -> (known after apply)
        name                = "dags/sync_littlepay_v3/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_api/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "dz7uzA==" -> (known after apply)
!~      detect_md5hash      = "BIiiuffNcTJ2hEwgHT9kFg==" -> "different hash"
!~      generation          = 1764029751600678 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_api/METADATA.yml"
!~      md5hash             = "BIiiuffNcTJ2hEwgHT9kFg==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_xlsx/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "5ulmXg==" -> (known after apply)
!~      detect_md5hash      = "j3z2IFDmsCfapDNJ7RaBOg==" -> "different hash"
!~      generation          = 1764029751508258 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_xlsx/METADATA.yml"
!~      md5hash             = "j3z2IFDmsCfapDNJ7RaBOg==" -> (known after apply)
        name                = "dags/sync_ntd_data_xlsx/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/unzip_and_validate_gtfs_schedule_hourly/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "bvS0rQ==" -> (known after apply)
!~      detect_md5hash      = "ZLplsbni/zP6LuQ5XaXgWQ==" -> "different hash"
!~      generation          = 1764029751931012 -> (known after apply)
        id                  = "calitp-staging-composer-dags/unzip_and_validate_gtfs_schedule_hourly/METADATA.yml"
!~      md5hash             = "ZLplsbni/zP6LuQ5XaXgWQ==" -> (known after apply)
        name                = "dags/unzip_and_validate_gtfs_schedule_hourly/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/download_config_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "rVl5AQ==" -> (known after apply)
!~      detect_md5hash      = "/NQgFN9OopgfEltaQ1kNuA==" -> "different hash"
!~      generation          = 1764017282355947 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/download_config_hook.py"
!~      md5hash             = "/NQgFN9OopgfEltaQ1kNuA==" -> (known after apply)
        name                = "plugins/hooks/download_config_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "FCj9Ew==" -> (known after apply)
!~      detect_md5hash      = "olpBkGyIx2+EVSsj0Hlzng==" -> "different hash"
!~      generation          = 1763689442298467 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "olpBkGyIx2+EVSsj0Hlzng==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "ffuxnw==" -> (known after apply)
!~      detect_md5hash      = "SK9qgNOZJS1jEaZhc+dC0Q==" -> "different hash"
!~      generation          = 1763689441877246 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "SK9qgNOZJS1jEaZhc+dC0Q==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "0vYssg==" -> (known after apply)
!~      detect_md5hash      = "ceCceH5eio9veoWQf/mu0Q==" -> "different hash"
!~      generation          = 1763689442378391 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "ceCceH5eio9veoWQf/mu0Q==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gcs_download_config_filter_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "tAt1QA==" -> (known after apply)
!~      detect_md5hash      = "EHjLzs6qnZDdcCwPpsJ2kQ==" -> "different hash"
!~      generation          = 1763689441651781 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gcs_download_config_filter_operator.py"
!~      md5hash             = "EHjLzs6qnZDdcCwPpsJ2kQ==" -> (known after apply)
        name                = "plugins/operators/gcs_download_config_filter_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "lLnQBQ==" -> (known after apply)
!~      detect_md5hash      = "zVlcX1bMFa8ygDspvqkG1w==" -> "different hash"
!~      generation          = 1763689441659821 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "zVlcX1bMFa8ygDspvqkG1w==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Ffsqww==" -> (known after apply)
!~      detect_md5hash      = "lSps+/mqcT7i+Novy6U6tQ==" -> "different hash"
!~      generation          = 1763689442499541 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "lSps+/mqcT7i+Novy6U6tQ==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Dk6EtA==" -> (known after apply)
!~      detect_md5hash      = "lOcfAHCpzepXCTZJLMXmFQ==" -> "different hash"
!~      generation          = 1763689442086961 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "lOcfAHCpzepXCTZJLMXmFQ==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 27 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1086](https://github.com/cal-itp/data-infra/actions/runs/19680984137)